Data/SimulationFiles/K5_Re176/BaseModel/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include "../config"

convertToMeters 1;

vertices
(
    (-1   0       -1)   //0
    ( 1   0   	  -1)   //1
    ( 1   $sigma  -1)   //2
    (-1   $sigma  -1)   //3

    (-1   0        1)   //4
    ( 1   0        1)   //5
    ( 1   $sigma   1)  //6
    (-1   $sigma   1)   //7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) ($nCellsX $nCellsY 1) simpleGrading (1 $wallGrading 1)
);

edges
(
);

boundary
(
    inlet
    {
        type 			cyclic;
        neighbourPatch 	outlet;
        faces
        (
            (0 3 7 4)
        );
    }
    
    outlet
    {
        type 			cyclic;
        neighbourPatch 	inlet;
        faces
        (
            (1 2 6 5)
        );
    } 
    
    fixedWalls-bottom
    {
        type wall;
        faces
        (
            (0 1 5 4)
        );
    }
    
    fixedWalls-top
    {
        type symmetry;
        faces
        (
            (3 2 6 7)
        );
    }

    frontAndBack
    {
        type empty;
        faces
        (
        (0 1 2 3)
	    (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
